In [1]:
import pandas as pd
import os

In [2]:
PATH = "../Datasets/SolarRadiation/"

In [3]:
titles = os.listdir(PATH)

Reading files

In [4]:
df = pd.read_excel(PATH + titles[0])

In [5]:
df

      Parámetro       Fecha  valor Unidad
0           NaN         NaN    NaN    NaN
1            RS  2018-03-02    1.0   W/m2
2            RS  2018-03-02    1.0   W/m2
3            RS  2018-03-02    1.0   W/m2
4            RS  2018-03-02    1.0   W/m2
...         ...         ...    ...    ...
13536        RS  2020-03-02  545.0   W/m2
13537        RS  2020-03-02  232.0   W/m2
13538        RS  2020-03-02  180.0   W/m2
13539        RS  2020-03-02   77.0   W/m2
13540        RS  2020-03-02    1.0   W/m2

[13541 rows x 4 columns]

Dropping empty instances

In [7]:
df.dropna(how='all', inplace=True)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13540 entries, 1 to 13540
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  13540 non-null  object
 1   Fecha      13540 non-null  object
 2   valor      13540 non-null  float64
 3   Unidad     13540 non-null  object
dtypes: float64(1), object(3)
memory usage: 528.9+ KB

Creating the complete dataset

In [9]:
for df_i in titles[1:]:
    df_i = pd.read_excel(PATH + df_i)
    df_i = df_i.dropna(how='all')
    df = pd.concat([df, df_i], axis=0)

In [10]:
df

     Parámetro       Fecha  valor Unidad
1           RS  2018-03-02    1.0   W/m2
2           RS  2018-03-02    1.0   W/m2
3           RS  2018-03-02    1.0   W/m2
4           RS  2018-03-02    1.0   W/m2
5           RS  2018-03-02    1.0   W/m2
...        ...         ...    ...    ...
7546        RS  2025-03-09    0.0   W/m2
7547        RS  2025-03-09    0.0   W/m2
7548        RS  2025-03-09    0.0   W/m2
7549        RS  2025-03-09    0.0   W/m2
7550        RS  2025-03-09    0.0   W/m2

[44746 rows x 4 columns]

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 44746 entries, 1 to 7550
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  44746 non-null  object
 1   Fecha      44746 non-null  object
 2   valor      44746 non-null  float64
 3   Unidad     44746 non-null  object
dtypes: float64(1), object(3)
memory usage: 1.7+ MB

Dropping unnecessary columns

In [12]:
df.drop(["Parámetro", "Unidad"], axis=1, inplace=True)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 44746 entries, 1 to 7550
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   44746 non-null  object
 1   valor   44746 non-null  float64
dtypes: float64(1), object(1)
memory usage: 1.0+ MB

Formating dates

In [14]:
df["Fecha"] = pd.to_datetime(df["Fecha"])

In [15]:
df.head()

       Fecha  valor
1 2018-03-02    1.0
2 2018-03-02    1.0
3 2018-03-02    1.0
4 2018-03-02    1.0
5 2018-03-02    1.0

Changing column names

In [16]:
df.rename(columns={"valor":"SolarRadiation"}, inplace=True)

In [17]:
df

          Fecha  SolarRadiation
1    2018-03-02             1.0
2    2018-03-02             1.0
3    2018-03-02             1.0
4    2018-03-02             1.0
5    2018-03-02             1.0
...         ...             ...
7546 2025-03-09             0.0
7547 2025-03-09             0.0
7548 2025-03-09             0.0
7549 2025-03-09             0.0
7550 2025-03-09             0.0

[44746 rows x 2 columns]

Grouping per day and taking in consideration the average

In [18]:
df = df.groupby("Fecha", as_index=False).mean()

In [19]:
df

          Fecha  SolarRadiation
0    2018-03-02      257.333333
1    2018-03-03      277.208333
2    2018-03-04      267.916667
3    2018-03-05      255.625000
4    2018-03-06      238.791667
...         ...             ...
2335 2025-03-05        0.000000
2336 2025-03-06        0.000000
2337 2025-03-07        0.000000
2338 2025-03-08        0.000000
2339 2025-03-09        0.000000

[2340 rows x 2 columns]

In [20]:
df.to_csv(PATH + "SolarRadiation.csv", index=False)